app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a title 0380/4"], ["description", "this is a random description "], ["created_at", "2018-10-08 17:16:18.439917"], ["updated_at", "2018-10-08 17:16:18.439917"]]

    def update
        @article = Article.find(params[:id])
        if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?